def test(a, b, *args, **kwargs):
    print(a)
    print(b)
    print(args)
    print(kwargs)


# print里面添加*表示拆包，如果字典不拆包那么就会存放在*args里面
A = (1, 2, 3)  # 此处A表示的是一个元组，传递的适合需要添加*号拆包
B = (4, 5, 6)
C = {"name": "tom", "age": 18}
# 在参数前添加*或者** 可以将对应的元组和字典传给*args和**kwargs，这就是拆包，加星号就是拆包
# 注意，如果添加*在实参前进行拆包和不加* 得到的结果是不一样的
test(11, 22, A, B, C)
print("---------------------------------------------------------------")
test(11, 22, *A, B, C)
print("---------------------------------------------------------------")
test(11, 22, *A, *B, C)
print("---------------------------------------------------------------")
test(11, 22, *A, *B, **C)
